Table of Contents
 Class Constants
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
public sealed class Constants
Inheritance
object
Constants
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
Fields
 AutomationParam
public const string AutomationParam = "-automation"
Field Value
string
 BlobStorageId
public const string BlobStorageId = "blobStorageId"
Field Value
string
 CheckbotAppName
public const string CheckbotAppName = "IdeaCheckbot.exe"
Field Value
string
 ConCalculatorCancelEventFormat
public const string ConCalculatorCancelEventFormat = "IdeaStatiCa.ConnHiddenCalculatorCancel-{0}"
Field Value
string
 ConCalculatorChangedEventFormat
public const string ConCalculatorChangedEventFormat = "IdeaStatiCa.ConnHiddenCalculator-{0}"
Field Value
string
 ConnHiddenCalculatorUrlFormat
public const string ConnHiddenCalculatorUrlFormat = "net.pipe://localhost/IdeaStatiCa.ConnHiddenCalculator{0}"
Field Value
string
 ConnectionChangedEventFormat
public const string ConnectionChangedEventFormat = "IdeaStatiCaConnectionChanged{0}"
Field Value
string
 ContentId
public const string ContentId = "contentId"
Field Value
string
 DefaultIdeaStaticaAutoUrlFormat
public const string DefaultIdeaStaticaAutoUrlFormat = "net.pipe://localhost/IdeaStatiCaAuto{0}"
Field Value
string
 DefaultPluginEventName
public const string DefaultPluginEventName = "IdeaStatiCaBIMPluginEvent"
Field Value
string
 DefaultPluginUrlFormat
public const string DefaultPluginUrlFormat = "net.pipe://localhost/IdeaBIMPlugin{0}"
Field Value
string
 DetailChangedEventFormat
public const string DetailChangedEventFormat = "IdeaStatiCaDetailChanged{0}"
Field Value
string
 GRPC_CHECKBOT_HANDLER_MESSAGE
public const string GRPC_CHECKBOT_HANDLER_MESSAGE = "Grpc.Handlers.CheckBot"
Field Value
string
 GRPC_CHUNK_SIZE
public const int GRPC_CHUNK_SIZE = 65536
Field Value
int
 GRPC_MAX_MSG_SIZE
public const int GRPC_MAX_MSG_SIZE = 104857600
Field Value
int
 GRPC_PROJECTCONTENT_HANDLER_MESSAGE
public const string GRPC_PROJECTCONTENT_HANDLER_MESSAGE = "Grpc.Handlers.ProjContent"
Field Value
string
 GRPC_REFLECTION_HANDLER_MESSAGE
public const string GRPC_REFLECTION_HANDLER_MESSAGE = "Grpc.Handlers.Reflection"
Field Value
string
 GrpcControlPortParam
public const string GrpcControlPortParam = "-grpcPort"
Field Value
string
 GrpcDataPort
public const string GrpcDataPort = "-grpcConnectionPort"
Field Value
string
 GrpcReflectionErrorException
public const string GrpcReflectionErrorException = "GrpcReflectionError"
Field Value
string
 IdeaConnectionAppName
public const string IdeaConnectionAppName = "IdeaConnection.exe"
Field Value
string
 IdeaStatiCaVersion
public const string IdeaStatiCaVersion = "21.1"
Field Value
string
 LibraryReposPath
public const string LibraryReposPath = "-libReposPath"
Field Value
string
 MaxGrpcPort
public const int MaxGrpcPort = 50500
Field Value
int
 MemHiddenCalcCancelEventFormat
public const string MemHiddenCalcCancelEventFormat = "IdeaStatiCa.MemberHiddenCalculatorCancel-{0}"
Field Value
string
 MemHiddenCalcChangedEventFormat
public const string MemHiddenCalcChangedEventFormat = "IdeaStatiCa.MemberHiddenCalculator-{0}"
Field Value
string
 MemberChangedEventFormat
public const string MemberChangedEventFormat = "IdeaStatiCaMemberChanged{0}"
Field Value
string
 MemberEventName
public const string MemberEventName = "MemberPluginEvent"
Field Value
string
 MemberHiddenCalculatorUrlFormat
public const string MemberHiddenCalculatorUrlFormat = "net.pipe://localhost/IdeaStatiCa.MemberHiddenCalculator{0}"
Field Value
string
 MemberUrlFormat
public const string MemberUrlFormat = "net.pipe://localhost/IdeaMember{0}"
Field Value
string
 MinGrpcPort
public const int MinGrpcPort = 50000
Field Value
int
 ProgressCallbackUrlFormat
public const string ProgressCallbackUrlFormat = "net.pipe://localhost/IdeaStatiCaProgress{0}"
Field Value
string
 ProjectParam
public const string ProjectParam = "-project"
Field Value
string
 ViewerPluginAppName
public const string ViewerPluginAppName = "IdeaStatiCa.ViewerPlugin.exe"
Field Value
string
 Edit this page